package lesson1;
//Задача 2 Создать класс BankAccount с полями
//
//сумму на счету
//номер счета (уникальное значение)
//процент на остаток (годовой процент)
//Создайте метод printInfo для вывода атрибутов счета
//
//Создайте массив счетов на 10 элементов и заполните его рандомно. Не забудьте, что номер счета при этом не должен повторяться.
//Создайте меню:
//1. Вывести все счета
//2. Вывести сумму на счете по номеру (юзер вводит номер)
//3. Сделать перевод. Юзер вводит номер счета-отправителя, номер счета-получателя и сумму перевода. Сделайте проверку, что баланса отправителя хватает для перевода
//4. Найти счет с самым большим процентом на остаток (найти целый объект)
//5. Найти счет, владелец которого заработает больше всех процентов, если будет держать деньги на нем целый год. Прибыль за год вычисляется по формуле сумма на счету * процент на остаток / 100
//6. Выход

public class Main2 {

}
