package lesson1;

//Задача 3 Создать класс Calculator.
//Методы:
//int sum(int a, int b) - принимает 2 числа через параметры и возвращает сумму чисел
//int minus(int a, int b) - возвращает разницу чисел
//mult - принимает 2 числа через параметры и возвращает произведение чисел
//divide - принимает 2 числа через параметры и возвращает результат деления чисел
//greater - принимает 2 числа через параметры и возвращает нибольшее из двух чисел или любое из них, если числа равны
//lesser - принимает 2 числа через параметры и возвращает наименьшее из двух чисел или любое из них, если числа равны
//abs - принимает 1 положительное или отрицательное число и возвращает его по модулю (со знаком плюс). Модуль это число со знаком плюс. Пример: модуль числа 5 равен 5, модуль числа -5 равен 5.
//
//
//В мейне создайте объект класса Calculator и меню:
//1. Сложить (нужно считать два числа и вызвать метод sum)
//2. Умножить (нужно считать два числа вызвать метод mult)
//3. Делить (нужно считать два числа вызвать метод divide)
//4. Вычесть (нужно считать два числа вызвать метод mult)
//4. Наибольшее (нужно считать два числа вызвать метод greater)
//5. Наименьшее (нужно считать два числа вызвать метод lesser)
//6. Модуль (нужно считать одно число вызвать метод abs)

//7. Выход
public class Main3 {
    public static void main(String[] args) {

    }
}
